rogerclarkmelbourne/Arduino_STM32/STM32F1/boards.txt
# STM32 Boards

menu.cpu=Processor
menu.cpu_upload_menu=CPU & Upload mode
menu.device_variant=Variant

menu.upload_method=Upload method

##############################################################
maple_mini.name=LeafLabs Maple Mini Rev 2 to Flash

maple_mini.upload.tool=maple_upload
maple_mini.upload.protocol=maple_dfu
maple_mini.upload.maximum_size=108000
maple_mini.upload.use_1200bps_touch=false
maple_mini.upload.file_type=bin
maple_mini.upload.ram.maximum_size=17000
maple_mini.upload.flash.maximum_size=108000

maple_mini.upload.usbID=1EAF:0003
maple_mini.upload.altID=1
maple_mini.upload.auto_reset=true

maple_mini.build.mcu=cortex-m3
maple_mini.build.f_cpu=72000000L
maple_mini.build.board=MAPLE_MINI
maple_mini.build.core=maple
maple_mini.build.extra_flags=-DMCU_STM32F103CB -mthumb  -DBOOTLOADER_maple -march=armv7-m -D__STM32F1__ 
maple_mini.build.ldscript=ld/flash.ld
maple_mini.build.variant=maple_mini
maple_mini.build.variant_system_lib=libmaple.a
maple_mini.build.vect=VECT_TAB_FLASH
maple_mini.build.density=STM32_MEDIUM_DENSITY
maple_mini.build.error_led_port=GPIOB
maple_mini.build.error_led_pin=1
maple_mini.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1

##############################################################
#maple_miniRAM.name=LeafLabs Maple Mini Rev 2 to RAM
#
#maple_miniRAM.upload.tool=maple_upload
#maple_miniRAM.upload.protocol=maple_dfu
#maple_miniRAM.upload.maximum_size=17000
#maple_miniRAM.upload.use_1200bps_touch=false
#maple_miniRAM.upload.file_type=bin
#maple_miniRAM.upload.ram.maximum_size=17000
#maple_miniRAM.upload.flash.maximum_size=108000
#maple_miniRAM.upload.usbID=1EAF:0003
#maple_miniRAM.upload.altID=0
#maple_miniRAM.upload.auto_reset=true
#
#maple_miniRAM.build.mcu=cortex-m3
#maple_miniRAM.build.f_cpu=72000000L
#maple_miniRAM.build.board=MAPLE_MINI_RAM
#maple_miniRAM.build.core=maple
#maple_miniRAM.build.extra_flags=-DMCU_STM32F103CB -mthumb  -DBOOTLOADER_maple -march=armv7-m -D__STM32F1__ 
#maple_miniRAM.build.ldscript=ld/ram.ld
#maple_miniRAM.build.variant=maple_mini
#maple_miniRAM.build.variant_system_lib=libmaple.a
#maple_miniRAM.build.vect=VECT_TAB_RAM
#maple_miniRAM.build.density=STM32_MEDIUM_DENSITY
#maple_miniRAM.build.error_led_port=GPIOB
#maple_miniRAM.build.error_led_pin=1
#maple_miniRAM.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1



##############################################################
maple.name=LeafLabs Maple Rev 3+ to Flash

maple.upload.tool=maple_upload
maple.upload.protocol=maple_dfu
maple.upload.maximum_size=108000
maple.upload.use_1200bps_touch=false
maple.upload.file_type=bin
maple.upload.ram.maximum_size=17000
maple.upload.flash.maximum_size=108000
maple.upload.usbID=1EAF:0003
maple.upload.altID=1
maple.upload.auto_reset=true

maple.build.mcu=cortex-m3
maple.build.f_cpu=72000000L
maple.build.board=MAPLE_REV3
maple.build.core=maple
maple.build.extra_flags=-DMCU_STM32F103RB -mthumb  -DBOOTLOADER_maple -march=armv7-m  -D__STM32F1__  
maple.build.ldscript=ld/flash.ld
maple.build.variant=maple
maple.build.variant_system_lib=libmaple.a
maple.build.vect=VECT_TAB_FLASH
maple.build.density=STM32_MEDIUM_DENSITY
maple.build.error_led_port=GPIOA
maple.build.error_led_pin=5
maple.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1


##############################################################
mapleRET6.name=LeafLabs Maple RET6 to Flash

mapleRET6.upload.tool=maple_upload
mapleRET6.upload.protocol=maple_dfu
mapleRET6.upload.maximum_size=492000
mapleRET6.upload.use_1200bps_touch=false
mapleRET6.upload.file_type=bin
mapleRET6.upload.ram.maximum_size=61000
mapleRET6.upload.flash.maximum_size=492000
mapleRET6.upload.usbID=1EAF:0003
mapleRET6.upload.altID=1
mapleRET6.upload.auto_reset=true

mapleRET6.build.mcu=cortex-m3
mapleRET6.build.f_cpu=72000000L
mapleRET6.build.board=MAPLE_RET6
mapleRET6.build.core=maple
mapleRET6.build.extra_flags=-DMCU_STM32F103RE -mthumb -DBOOTLOADER_maple -march=armv7-m -D__STM32F1__

mapleRET6.build.ldscript=ld/flashRET6.ld
mapleRET6.build.variant=maple
mapleRET6.build.variant_system_lib=libmapleRET6.a
mapleRET6.build.vect=VECT_TAB_FLASH
mapleRET6.build.density=STM32_HIGH_DENSITY
mapleRET6.build.error_led_port=GPIOA
mapleRET6.build.error_led_pin=5
mapleRET6.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1

##############################################################
genericSTM32.name=STM32 to Flash - No bootloader

genericSTM32.menu.upload_method.serialMethod=Serial
genericSTM32.menu.upload_method.serialMethod.upload.protocol=maple_serial
genericSTM32.menu.upload_method.serialMethod.upload.tool=serial_upload
genericSTM32.menu.upload_method.STLinkMethod=STLink
genericSTM32.menu.upload_method.STLinkMethod.upload.protocol=STLink
genericSTM32.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

genericSTM32.upload.maximum_size=108000
genericSTM32.upload.use_1200bps_touch=false
genericSTM32.upload.file_type=bin
genericSTM32.upload.ram.maximum_size=17000
genericSTM32.upload.flash.maximum_size=108000

genericSTM32.upload.usbID=1EAF:0003
genericSTM32.upload.altID=1
genericSTM32.upload.auto_reset=true

genericSTM32.build.mcu=cortex-m3
genericSTM32.build.f_cpu=72000000L
genericSTM32.build.board=GENERIC_STM32
genericSTM32.build.core=maple
genericSTM32.build.extra_flags=-DMCU_STM32F103CB -mthumb   -march=armv7-m  -D__STM32F1__ 
genericSTM32.build.ldscript=ld/jtag.ld
genericSTM32.build.variant=maple_mini
genericSTM32.build.variant_system_lib=libmaple.a
genericSTM32.build.vect=VECT_TAB_FLASH
genericSTM32.build.density=STM32_MEDIUM_DENSITY
genericSTM32.build.error_led_port=GPIOB
genericSTM32.build.error_led_pin=1
genericSTM32.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1


##############################################################
genericSTM32F103R.name=Generic STM32F103RE
genericSTM32F103R.upload.maximum_size=492000
genericSTM32F103R.upload.ram.maximum_size=61000
genericSTM32F103R.upload.flash.maximum_size=492000
genericSTM32F103R.build.error_led_port=GPIOA
genericSTM32F103R.build.error_led_pin=5
genericSTM32F103R.build.variant=generic_stm32f103rxx
genericSTM32F103R.build.extra_flags=-DMCU_STM32F103RE -mthumb -march=armv7-m  -D__STM32F1__  
genericSTM32F103R.build.ldscript=ld/jtag.ld

genericSTM32F103R.upload.tool=serial_upload
genericSTM32F103R.upload.protocol=maple_dfu
genericSTM32F103R.upload.use_1200bps_touch=false
genericSTM32F103R.upload.file_type=bin
#genericSTM32F103R.upload.usbID=1EAF:0003
#genericSTM32F103R.upload.altID=1
#genericSTM32F103R.upload.auto_reset=true
genericSTM32F103R.build.mcu=cortex-m3
genericSTM32F103R.build.f_cpu=72000000L
genericSTM32F103R.build.board=GENERIC_STM32F103R
genericSTM32F103R.build.core=maple
genericSTM32F103R.build.vect=VECT_TAB_FLASH

