rogerclarkmelbourne/Arduino_STM32/STM32F1/boards.txt
##############################################################

microduino32_flash.name=Microduino Core STM32 to Flash

microduino32_flash.upload.tool=maple_upload
microduino32_flash.upload.protocol=maple_dfu
microduino32_flash.upload.maximum_size=108000
microduino32_flash.upload.use_1200bps_touch=false
microduino32_flash.upload.file_type=bin
microduino32_flash.upload.ram.maximum_size=17000
microduino32_flash.upload.flash.maximum_size=108000
microduino32_flash.upload.usbID=1EAF:0003
microduino32_flash.upload.altID=1
microduino32_flash.upload.auto_reset=true


microduino32_flash.build.mcu=cortex-m3
microduino32_flash.build.f_cpu=72000000L
microduino32_flash.build.board=MICRODUINO_CORE_STM32
microduino32_flash.build.core=maple
microduino32_flash.build.extra_flags=-DMCU_STM32F103CB -mthumb  -DBOOTLOADER_maple -march=armv7-m -D__STM32F1__ 
microduino32_flash.build.ldscript=ld/flash.ld
microduino32_flash.build.variant=microduino
microduino32_flash.build.variant_system_lib=libmaple.a
microduino32_flash.build.vect=VECT_TAB_FLASH
microduino32_flash.build.density=STM32_MEDIUM_DENSITY
# FIXME!
microduino32_flash.build.error_led_port=GPIOB
microduino32_flash.build.error_led_pin=1
microduino32_flash.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1

##############################################################
nucleo_f103rb.name=STM Nucleo F103RB (STLink)

nucleo_f103rb.upload.tool=stlink_upload
nucleo_f103rb.upload.protocol=maple_dfu
nucleo_f103rb.upload.maximum_size=108000
nucleo_f103rb.upload.use_1200bps_touch=false
nucleo_f103rb.upload.file_type=bin
nucleo_f103rb.upload.ram.maximum_size=17000
nucleo_f103rb.upload.flash.maximum_size=108000
nucleo_f103rb.upload.params.quiet=no

nucleo_f103rb.upload.usbID=1EAF:0003
nucleo_f103rb.upload.altID=1
nucleo_f103rb.upload.auto_reset=true

nucleo_f103rb.build.mcu=cortex-m3
nucleo_f103rb.build.f_cpu=72000000L
nucleo_f103rb.build.board=STM_NUCLEU_F103RB
nucleo_f103rb.build.core=maple
nucleo_f103rb.build.extra_flags=-DMCU_STM32F103RB -mthumb    -march=armv7-m  -D__STM32F1__ 
nucleo_f103rb.build.ldscript=ld/jtag.ld
nucleo_f103rb.build.variant=nucleo_f103rb
nucleo_f103rb.build.variant_system_lib=libmaple.a
nucleo_f103rb.build.vect=VECT_TAB_FLASH
nucleo_f103rb.build.density=STM32_MEDIUM_DENSITY
nucleo_f103rb.build.error_led_port=GPIOB
nucleo_f103rb.build.error_led_pin=1
nucleo_f103rb.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1






##############################################################
#mapleRAM.name=LeafLabs Maple Rev 3+ to RAM

#mapleRAM.upload.tool=maple_upload
#mapleRAM.upload.protocol=maple_dfu
#mapleRAM.upload.maximum_size=17000
#mapleRAM.upload.use_1200bps_touch=false
#mapleRAM.upload.file_type=bin
#mapleRAM.upload.ram.maximum_size=17000
#mapleRAM.upload.flash.maximum_size=108000
#mapleRAM.upload.usbID=1EAF:0003
#mapleRAM.upload.altID=0
#mapleRAM.upload.auto_reset=true
#
#mapleRAM.build.mcu=cortex-m3
#mapleRAM.build.f_cpu=72000000L
#mapleRAM.build.board=MAPLE_REV3_TO_RAM
#mapleRAM.build.core=maple
#mapleRAM.build.extra_flags=-DMCU_STM32F103RB -mthumb  -DBOOTLOADER_maple -march=armv7-m -D__STM32F1__ 
#mapleRAM.build.ldscript=ld/ram.ld
#mapleRAM.build.variant=maple
#mapleRAM.build.variant_system_lib=libmaple.a
#mapleRAM.build.vect=VECT_TAB_RAM
#mapleRAM.build.density=STM32_MEDIUM_DENSITY
#mapleRAM.build.error_led_port=GPIOA
#mapleRAM.build.error_led_pin=5
#mapleRAM.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1


#####################################################################

GenericSTM32F103C.name= Generic STM32F103C
GenericSTM32F103C.upload.tool=upload_router
#GenericSTM32F103C.upload.tool=maple_upload
GenericSTM32F103C.build.core=maple
GenericSTM32F103C.build.variant=generic_stm32f103c
GenericSTM32F103C.upload.use_1200bps_touch=false
GenericSTM32F103C.upload.file_type=bin
GenericSTM32F103C.upload.usbID=1EAF:0003
GenericSTM32F103C.upload.auto_reset=true
GenericSTM32F103C.build.mcu=cortex-m3
GenericSTM32F103C.build.f_cpu=72000000L
GenericSTM32F103C.build.board=GENERIC_STM32F103C
GenericSTM32F103C.build.common_flags=-mthumb  -march=armv7-m -D__STM32F1__ 
GenericSTM32F103C.build.variant_system_lib=libmaple.a
GenericSTM32F103C.build.error_led_port=GPIOB
GenericSTM32F103C.build.error_led_pin=1

## ==UPLOAD MODE==
## F103CB USB to Flash upload
## -------------------------
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash= F103CB(128k) USB->Flash
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.build.ldscript=ld/flash.ld
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.build.cpu_flags=-DMCU_STM32F103CB -DBOOTLOADER_maple 
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.build.vect=VECT_TAB_FLASH

GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.upload.maximum_size=108000
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.upload.ram.maximum_size=17000
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.upload.flash.maximum_size=108000
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.upload.altID=1
GenericSTM32F103C.menu.cpu_upload_menu.cbUsbFlash.upload.protocol=maple_dfu

## F103CB USB to RAM upload
## -------------------------
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM=F103CB(128k) USB->RAM
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.build.ldscript=ld/ram.ld
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.build.cpu_flags=-DMCU_STM32F103CB -DBOOTLOADER_maple 
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.build.vect=VECT_TAB_RAM
#
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.upload.maximum_size=17000
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.upload.ram.maximum_size=17000
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.upload.flash.maximum_size=108000
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.upload.altID=0
#GenericSTM32F103C.menu.cpu_upload_menu.cbUsbRAM.upload.protocol=maple_dfu

## UPLOAD MODE
## F103CB Serial to Flash upload (keep bootloader)
## -------------------------
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash=F103CB(128k) Serial->Flash (keeps bootloader)
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.build.ldscript=ld/flash.ld
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.build.cpu_flags=-DMCU_STM32F103CB -DBOOTLOADER_maple
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.build.vect=VECT_TAB_FLASH

