rogerclarkmelbourne/Arduino_STM32/STM32F1/boards.txt
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.upload.maximum_size=108000
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.upload.ram.maximum_size=17000
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.upload.flash.maximum_size=108000
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.upload.altID=1
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialFlash.upload.protocol=maple_serial

## UPLOAD MODE
## F103CB Serial to Flash upload (overwrites bootloader)
## -------------------------
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG=F103CB(128k) Serial->Flash (overwrites bootloader)
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.build.ldscript=ld/jtag.ld
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.build.cpu_flags=-DMCU_STM32F103CB  
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.build.vect=VECT_TAB_FLASH

GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.upload.maximum_size=128000
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.upload.ram.maximum_size=20000
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.upload.flash.maximum_size=128000
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.upload.altID=1
GenericSTM32F103C.menu.cpu_upload_menu.cbSerialJTAG.upload.protocol=maple_serial


## ==UPLOAD MODE F103C8 ==
## F103C8 USB to Flash upload
## -------------------------
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash=F103C8(64k) USB->Flash
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.build.ldscript=ld/flash_c8.ld
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.build.cpu_flags=-DMCU_STM32F103C8 -DBOOTLOADER_maple
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.build.vect=VECT_TAB_FLASH

GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.upload.maximum_size=44000
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.upload.ram.maximum_size=17000
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.upload.flash.maximum_size=44000
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.upload.altID=1
GenericSTM32F103C.menu.cpu_upload_menu.c8UsbFlash.upload.protocol=maple_dfu

## F103C8 USB to RAM upload
## -------------------------
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM=F103C8(64k) USB->RAM
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.build.ldscript=ld/ram_c8.ld
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.build.cpu_flags=-DMCU_STM32F103C8 -DBOOTLOADER_maple
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.build.vect=VECT_TAB_RAM
#
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.upload.maximum_size=17000
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.upload.ram.maximum_size=17000
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.upload.flash.maximum_size=44000
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.upload.altID=0
#GenericSTM32F103C.menu.cpu_upload_menu.c8UsbRAM.upload.protocol=maple_dfu

## F103C8 Serial to Flash upload (keep bootloader)
## -------------------------
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash=F103C8(64k) Serial->Flash (keeps bootloader)
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.build.ldscript=ld/flash_c8.ld
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.build.cpu_flags=-DMCU_STM32F103C8 -DBOOTLOADER_maple
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.build.vect=VECT_TAB_FLASH

GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.upload.maximum_size=44000
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.upload.ram.maximum_size=17000
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.upload.flash.maximum_size=44000
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.upload.altID=1
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialFlash.upload.protocol=maple_serial

## F103C8 Serial to Flash upload (overwrites bootloader)
## -------------------------
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG=F103C8(64k) Serial->Flash (overwrites bootloader)
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.build.ldscript=ld/jtag_c8.ld
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.build.cpu_flags=-DMCU_STM32F103C8
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.build.vect=VECT_TAB_FLASH

GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.upload.maximum_size=64000
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.upload.ram.maximum_size=20000
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.upload.flash.maximum_size=64000
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.upload.altID=1
GenericSTM32F103C.menu.cpu_upload_menu.c8SerialJTAG.upload.protocol=maple_serial

##############################################################
genericSTM32F103Z.name=Generic STM32F103Z

#genericSTM32F103Z.upload.maximum_size=492000
#genericSTM32F103Z.upload.ram.maximum_size=61000
#genericSTM32F103Z.upload.flash.maximum_size=492000

genericSTM32F103Z.build.error_led_port=GPIOG
genericSTM32F103Z.build.error_led_pin=15
genericSTM32F103Z.build.variant=generic_stm32f103zxx

#genericSTM32F103Z.build.extra_flags=-DMCU_STM32F103ZE -mthumb -march=armv7-m  -D__STM32F1__  
#genericSTM32F103Z.build.ldscript=ld/jtag.ld

genericSTM32F103Z.upload.tool=serial_upload
genericSTM32F103Z.upload.protocol=
genericSTM32F103Z.upload.use_1200bps_touch=false
genericSTM32F103Z.upload.file_type=bin
genericSTM32F103Z.build.mcu=cortex-m3
genericSTM32F103Z.build.f_cpu=72000000L
genericSTM32F103Z.build.board=GENERIC_STM32F103Z
genericSTM32F103Z.build.core=maple
genericSTM32F103Z.build.vect=VECT_TAB_FLASH

genericSTM32F103Z.menu.device_variant.STM32F103ZC=STM32F103ZC
genericSTM32F103Z.menu.device_variant.STM32F103ZC.build.extra_flags=-DMCU_STM32F103ZC -mthumb -march=armv7-m  -D__STM32F1__  
genericSTM32F103Z.menu.device_variant.STM32F103ZC.upload.maximum_size=262144
genericSTM32F103Z.menu.device_variant.STM32F103ZC.upload.ram.maximum_size=492152
genericSTM32F103Z.menu.device_variant.STM32F103ZC.upload.flash.maximum_size=262144
genericSTM32F103Z.menu.device_variant.STM32F103ZC.build.ldscript=ld/stm32f103zc.ld

genericSTM32F103Z.menu.device_variant.STM32F103ZD=STM32F103ZD
genericSTM32F103Z.menu.device_variant.STM32F103ZD.build.extra_flags=-DMCU_STM32F103ZD -mthumb -march=armv7-m  -D__STM32F1__  
genericSTM32F103Z.menu.device_variant.STM32F103ZD.upload.maximum_size=393216
genericSTM32F103Z.menu.device_variant.STM32F103ZD.upload.ram.maximum_size=65536
genericSTM32F103Z.menu.device_variant.STM32F103ZD.upload.flash.maximum_size=393216
genericSTM32F103Z.menu.device_variant.STM32F103ZD.build.ldscript=ld/stm32f103zd.ld

genericSTM32F103Z.menu.device_variant.STM32F103ZE=STM32F103ZE
genericSTM32F103Z.menu.device_variant.STM32F103ZE.build.extra_flags=-DMCU_STM32F103ZE -mthumb -march=armv7-m  -D__STM32F1__  
genericSTM32F103Z.menu.device_variant.STM32F103ZE.upload.maximum_size=524288
genericSTM32F103Z.menu.device_variant.STM32F103ZE.upload.ram.maximum_size=65536
genericSTM32F103Z.menu.device_variant.STM32F103ZE.upload.flash.maximum_size=524288
genericSTM32F103Z.menu.device_variant.STM32F103ZE.build.ldscript=ld/stm32f103ze.ld